int/resources/objectRepo/xmlTemplates/opera/Channel/req_CreateChannelCarriers.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/par/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateChannelCarriersRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:Carriers BookingChannelCode="?">
            <v9:Carrier>
               <v91:CarrierCode Code="?" Description="?"/>
               <v91:Merchant/>
               <v91:Inactive/>
            </v9:Carrier>
         </v9:Carriers>
      </v9:CreateChannelCarriersRQ>
   </soapenv:Body>
</soapenv:Envelope>